{"cpe:2.3:a:ambarella:oryx_rtsp_server:2020-01-07:*:*:*:*:*:*:*": [{"cve_id": "CVE-2020-24918", "severity": "critical", "cvss_score": 9.8, "description": "A buffer overflow in the RTSP service of the Ambarella Oryx RTSP Server 2020-01-07 allows an unauthenticated attacker to send a crafted RTSP request, with a long digest authentication header, to execute arbitrary code in parse_authentication_header() in libamprotocol-rtsp.so.1 in rtsp_svc (or cause a crash). This allows remote takeover of a Furbo Dog Camera, for example. NOTE: The vendor states that the RTSP library is used for DEMO only, using it in product is a customer's behavior. Ambarella has emphasized that RTSP is DEMO only library, should NOT be used in product in our document. Because Ambarella's SDK is proprietary, we didn't publish our SDK source code in public network.", "published": "2021-04-30T12:15:07.460", "last_modified": "2024-11-21T05:16:12.780"}], "cpe:2.3:a:phz76:rtspserver:1.0.0:*:*:*:*:*:*:*": [{"cve_id": "CVE-2023-6888", "severity": "medium", "cvss_score": 6.3, "description": "A vulnerability classified as critical was found in PHZ76 RtspServer 1.0.0. This vulnerability affects the function ParseRequestLine of the file RtspMesaage.cpp. The manipulation leads to stack-based buffer overflow. The attack can be initiated remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-248248. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.", "published": "2023-12-17T01:15:27.783", "last_modified": "2024-11-21T08:44:46.013"}], "cpe:2.3:o:microsoft:windows:-:*:*:*:*:*:*:*": [{"cve_id": "CVE-2008-3897", "severity": "low", "cvss_score": 2.1, "description": "DiskCryptor 0.2.6 on Windows stores pre-boot authentication passwords in the BIOS Keyboard buffer and does not clear this buffer before and after use, which allows local users to obtain sensitive information by reading the physical memory locations associated with this buffer.", "published": "2008-09-03T14:12:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-2747", "severity": "low", "cvss_score": 2.1, "description": "No-IP Dynamic Update Client (DUC) 2.2.1 on Windows uses weak permissions for the HKLM\\SOFTWARE\\Vitalwerks\\DUC registry key, which allows local users to obtain obfuscated passwords and other sensitive information by reading the (1) TrayPassword, (2) Username, (3) Password, and (4) Hosts registry values.", "published": "2008-06-18T19:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2006-2312", "severity": "low", "cvss_score": 2.6, "description": "Argument injection vulnerability in the URI handler in Skype 2.0.*.104 and 2.5.*.0 through 2.5.*.78 for Windows allows remote authorized attackers to download arbitrary files via a URL that contains certain command-line switches.", "published": "2006-05-19T21:02:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0524", "severity": "low", "cvss_score": 2.1, "description": "ICMP information such as (1) netmask and (2) timestamp is allowed from arbitrary hosts.", "published": "1997-08-01T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2008-3851", "severity": "medium", "cvss_score": 5.0, "description": "Multiple directory traversal vulnerabilities in Pluck CMS 4.5.2 on Windows allow remote attackers to include and execute arbitrary local files via a ..\\ (dot dot backslash) in the (1) blogpost, (2) cat, and (3) file parameters to data/inc/themes/predefined_variables.php, as reachable through index.php; and the (4) blogpost and (5) cat parameters to data/inc/blog_include_react.php, as reachable through index.php.  NOTE: the issue involving vectors 1 through 3 reportedly exists because of an incomplete fix for CVE-2008-3194.", "published": "2008-08-27T23:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-2099", "severity": "medium", "cvss_score": 6.9, "description": "Unspecified vulnerability in VMCI in VMware Workstation 6 before 6.0.4 build 93057, VMware Player 2 before 2.0.4 build 93057, and VMware ACE 2 before 2.0.2 build 93057 on Windows allows guest OS users to execute arbitrary code on the host OS via unspecified vectors.", "published": "2008-06-02T21:30:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1299", "severity": "medium", "cvss_score": 6.1, "description": "Cross-site scripting (XSS) vulnerability in SolutionSearch.do in ManageEngine ServiceDesk Plus 7.0.0 Build 7011 for Windows allows remote attackers to inject arbitrary web script or HTML via the searchText parameter.  NOTE: the provenance of this information is unknown; the details are obtained solely from third party information.", "published": "2008-03-12T17:44:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1302", "severity": "medium", "cvss_score": 5.0, "description": "The Perforce service (p4s.exe) in Perforce Server 2007.3/143793 and earlier allows remote attackers to cause a denial of service (daemon crash) via a (1) server-DiffFile or (2) server-ReleaseFile command with a large integer value, which is used in an array initialization calculation, and leads to invalid memory access.", "published": "2008-03-12T17:44:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-6404", "severity": "medium", "cvss_score": 5.0, "description": "Directory traversal vulnerability in Sergey Lyubka Simple HTTPD (shttpd) 1.38 and earlier on Windows allows remote attackers to read arbitrary files via a ..\\ (dot dot backslash) in the URI.", "published": "2007-12-17T18:46:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-4692", "severity": "medium", "cvss_score": 4.3, "description": "The tabbed browsing feature in Apple Safari 3 before Beta Update 3.0.4 on Windows, and Mac OS X 10.4 through 10.4.10, allows remote attackers to spoof HTTP authentication for other sites and possibly conduct phishing attacks by causing an authentication sheet to be displayed for a tab that is not active, which makes it appear as if it is associated with the active tab.", "published": "2007-11-15T00:46:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:a:microsoft:.net_windows_server:-:*:*:*:*:*:*:*": [], "cpe:2.3:o:microsoft:windows_2000:-:*:*:*:*:*:*:*": [{"cve_id": "CVE-1999-0585", "severity": "low", "cvss_score": 2.1, "description": "A Windows NT administrator account has the default name of Administrator.", "published": "2000-07-01T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0487", "severity": "low", "cvss_score": 3.6, "description": "The Protected Store in Windows 2000 does not properly select the strongest encryption when available, which causes it to use a default of 40-bit encryption instead of 56-bit DES encryption, aka the \"Protected Store Key Length\" vulnerability.", "published": "2000-06-01T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0311", "severity": "low", "cvss_score": 2.1, "description": "The Windows 2000 domain controller allows a malicious user to modify Active Directory information by modifying an unprotected attribute, aka the \"Mixed Object Access\" vulnerability.", "published": "2000-04-20T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0232", "severity": "low", "cvss_score": 2.1, "description": "Microsoft TCP/IP Printing Services, aka Print Services for Unix, allows an attacker to cause a denial of service via a malformed TCP/IP print request.", "published": "2000-03-30T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0595", "severity": "low", "cvss_score": 2.1, "description": "A Windows NT system does not clear the system page file during shutdown, which might allow sensitive information to be recorded.", "published": "2000-01-20T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0717", "severity": "low", "cvss_score": 2.6, "description": "A remote attacker can disable the virus warning mechanism in Microsoft Excel 97.", "published": "1999-05-07T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0372", "severity": "low", "cvss_score": 2.1, "description": "The installer for BackOffice Server includes account names and passwords in a setup file (reboot.ini) which is not deleted.", "published": "1999-02-12T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0612", "severity": "low", "cvss_score": 0.0, "description": "A version of finger is running that exposes valid user information to any entity on the network.", "published": "1997-03-01T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0580", "severity": "medium", "cvss_score": 5.0, "description": "Windows 2000 Server allows remote attackers to cause a denial of service by sending a continuous stream of binary zeros to various TCP and UDP ports, which significantly increases the CPU utilization.", "published": "2000-06-30T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0581", "severity": "medium", "cvss_score": 5.0, "description": "Windows 2000 Telnet Server allows remote attackers to cause a denial of service by sending a continuous stream of binary zeros, which causes the server to crash.", "published": "2000-06-30T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}], "cpe:2.3:o:microsoft:windows_95:-:*:*:*:*:*:*:*": [{"cve_id": "CVE-2002-1692", "severity": "low", "cvss_score": 3.6, "description": "Buffer overflow in backup utility of Microsoft Windows 95 allows attackers to execute arbitrary code by causing a filename with a long extension to be placed in a folder to be backed up.", "published": "2002-12-31T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-1003", "severity": "low", "cvss_score": 2.6, "description": "NETBIOS client in Windows 95 and Windows 98 allows a remote attacker to cause a denial of service by changing a file sharing service to return an unknown driver type, which causes the client to crash.", "published": "2000-12-11T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0129", "severity": "low", "cvss_score": 2.1, "description": "Buffer overflow in the SHGetPathFromIDList function of the Serv-U FTP server allows attackers to cause a denial of service by performing a LIST command on a malformed .lnk file.", "published": "2000-02-04T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0749", "severity": "low", "cvss_score": 2.6, "description": "Buffer overflow in Microsoft Telnet client in Windows 95 and Windows 98 via a malformed Telnet argument.", "published": "1999-08-16T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0717", "severity": "low", "cvss_score": 2.6, "description": "A remote attacker can disable the virus warning mechanism in Microsoft Excel 97.", "published": "1999-05-07T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2007-1898", "severity": "medium", "cvss_score": 5.8, "description": "formmail.php in Jetbox CMS 2.1 allows remote attackers to send arbitrary e-mails (spam) via modified recipient, _SETTINGS[allowed_email_hosts][], and subject parameters.", "published": "2007-05-16T22:30:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-2186", "severity": "medium", "cvss_score": 5.0, "description": "Foxit Reader 2.0 allows remote attackers to cause a denial of service (application crash) via a crafted PDF document.", "published": "2007-04-24T17:19:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2006-7031", "severity": "medium", "cvss_score": 6.5, "description": "Microsoft Internet Explorer 6.0.2900 SP2 and earlier allows remote attackers to cause a denial of service (crash) via a table element with a CSS attribute that sets the position, which triggers an \"unhandled exception\" in mshtml.dll.", "published": "2007-02-23T03:28:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2006-7037", "severity": "medium", "cvss_score": 4.4, "description": "Mathcad 12 through 13.1 allows local users to bypass the security features by directly accessing or editing the XML representation of the worksheet with a text editor or other program, which allows attackers to (1) bypass password protection by replacing the password field with a hash of a known password, (2) modify timestamps to avoid detection of modifications, (3) remove locks by removing the \"is-locked\" attribute, and (4) view locked data, which is stored in plaintext.", "published": "2007-02-23T03:28:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2006-7039", "severity": "medium", "cvss_score": 5.0, "description": "The IMAP4 service in MERCUR Messaging 2005 before Service Pack 4 allows remote attackers to cause a denial of service (crash) via a message with a long subject field.", "published": "2007-02-23T03:28:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:o:microsoft:windows_98:-:*:*:*:*:*:*:*": [{"cve_id": "CVE-2003-1569", "severity": "medium", "cvss_score": 5.0, "description": "GoAhead WebServer before 2.1.5 on Windows 95, 98, and ME allows remote attackers to cause a denial of service (daemon crash) via an HTTP request with a (1) con, (2) nul, (3) clock$, or (4) config$ device name in a path component, different vectors than CVE-2001-0385.", "published": "2009-02-06T19:30:00.407", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2004-0230", "severity": "medium", "cvss_score": 5.0, "description": "TCP, when using a large Window Size, makes it easier for remote attackers to guess sequence numbers and cause a denial of service (connection loss) to persistent TCP connections by repeatedly injecting a TCP RST packet, especially in protocols that use long-lived connections, such as BGP.", "published": "2004-08-18T04:00:00.000", "last_modified": "2025-05-02T16:40:41.530"}, {"cve_id": "CVE-2003-0813", "severity": "medium", "cvss_score": 5.1, "description": "A multi-threaded race condition in the Windows RPC DCOM functionality with the MS03-039 patch installed allows remote attackers to cause a denial of service (crash or reboot) by causing two threads to process the same RPC request, which causes one thread to use memory after it has been freed, a different vulnerability than CVE-2003-0352 (Blaster/Nachi), CVE-2003-0715, and CVE-2003-0528, and as demonstrated by certain exploits against those vulnerabilities.", "published": "2003-11-17T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2002-0862", "severity": "medium", "cvss_score": 6.8, "description": "The (1) CertGetCertificateChain, (2) CertVerifyCertificateChainPolicy, and (3) WinVerifyTrust APIs within the CryptoAPI for Microsoft products including Microsoft Windows 98 through XP, Office for Mac, Internet Explorer for Mac, and Outlook Express for Mac, do not properly verify the Basic Constraints of intermediate CA-signed X.509 certificates, which allows remote attackers to spoof the certificates of trusted sites via a man-in-the-middle attack for SSL sessions, as originally reported for Internet Explorer and IIS.", "published": "2002-10-04T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2020-5674", "severity": "high", "cvss_score": 7.8, "description": "Untrusted search path vulnerability in the installers of multiple SEIKO EPSON products allows an attacker to gain privileges via a Trojan horse DLL in an unspecified directory.", "published": "2020-11-24T07:15:11.937", "last_modified": "2024-11-21T05:34:27.477"}, {"cve_id": "CVE-1999-1593", "severity": "high", "cvss_score": 7.6, "description": "Windows Internet Naming Service (WINS) allows remote attackers to cause a denial of service (connectivity loss) or steal credentials via a 1Ch registration that causes WINS to change the domain controller to point to a malicious server.  NOTE: this problem may be limited when Windows 95/98 clients are used, or if the primary domain controller becomes unavailable.", "published": "2009-01-15T01:30:00.407", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-4938", "severity": "high", "cvss_score": 7.6, "description": "Heap-based buffer overflow in libmpdemux/aviheader.c in MPlayer 1.0rc1 and earlier allows remote attackers to cause a denial of service (application crash) or possibly execute arbitrary code via a .avi file with certain large \"indx truck size\" and nEntriesInuse values, and a certain wLongsPerEntry value.", "published": "2007-09-18T19:17:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-3958", "severity": "high", "cvss_score": 7.1, "description": "Microsoft Windows Explorer (explorer.exe) allows user-assisted remote attackers to cause a denial of service via a certain GIF file, as demonstrated by Art.gif.", "published": "2007-07-24T18:30:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2003-1048", "severity": "high", "cvss_score": 7.8, "description": "Double free vulnerability in mshtml.dll for certain versions of Internet Explorer 6.x allows remote attackers to cause a denial of service (application crash) via a malformed GIF image.", "published": "2004-07-27T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-1218", "severity": "critical", "cvss_score": 9.8, "description": "The default configuration for the domain name resolver for Microsoft Windows 98, NT 4.0, 2000, and XP sets the QueryIpMatching parameter to 0, which causes Windows to accept DNS updates from hosts that it did not query, which allows remote attackers to poison the DNS cache.", "published": "2000-04-14T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}], "cpe:2.3:o:microsoft:windows_me:-:*:*:*:*:*:*:*": [{"cve_id": "CVE-2005-1214", "severity": "medium", "cvss_score": 5.1, "description": "Microsoft Agent allows remote attackers to spoof trusted Internet content and execute arbitrary code by disguising security prompts on a malicious Web page.", "published": "2005-06-14T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2005-1191", "severity": "medium", "cvss_score": 5.0, "description": "The Web View DLL (webvw.dll), as used in Windows Explorer on Windows 2000 systems, does not properly filter an apostrophe (\"'\") in the author name in a document, which allows attackers to execute arbitrary script via extra attributes when Web View constructs a mailto: link for the preview pane when the user selects the file.", "published": "2005-05-02T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2004-0790", "severity": "medium", "cvss_score": 5.0, "description": "Multiple TCP/IP and ICMP implementations allow remote attackers to cause a denial of service (reset TCP connections) via spoofed ICMP error messages, aka the \"blind connection-reset attack.\"  NOTE: CVE-2004-0790, CVE-2004-0791, and CVE-2004-1060 have been SPLIT based on different attacks; CVE-2005-0065, CVE-2005-0066, CVE-2005-0067, and CVE-2005-0068 are related identifiers that are SPLIT based on the underlying vulnerability.  While CVE normally SPLITs based on vulnerability, the attack-based identifiers exist due to the variety and number of affected implementations and solutions that address the attacks instead of the underlying vulnerabilities.", "published": "2005-04-12T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2004-1305", "severity": "medium", "cvss_score": 5.0, "description": "The Windows Animated Cursor (ANI) capability in Windows NT, Windows 2000 through SP4, Windows XP through SP1, and Windows 2003 allow remote attackers to cause a denial of service via (1) the frame number set to zero, which causes an invalid memory address to be used and leads to a kernel crash, or (2) the rate number set to zero, which leads to resource exhaustion and hang.", "published": "2004-12-23T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2004-1319", "severity": "medium", "cvss_score": 5.0, "description": "The DHTML Edit Control (dhtmled.ocx) allows remote attackers to inject arbitrary web script into other domains by setting a name for a window, opening a child page whose target is the window with the given name, then injecting the script from the parent into the child using execScript, as demonstrated by \"AbusiveParent\" in Internet Explorer 6.0.2900.2180.", "published": "2004-12-15T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2004-0839", "severity": "medium", "cvss_score": 5.0, "description": "Internet Explorer in Windows XP SP2, and other versions including 5.01 and 5.5, allows remote attackers to install arbitrary programs via a web page that uses certain styles and the AnchorClick behavior, popup windows, and drag-and-drop capabilities to drop the program in the local startup folder, as demonstrated by \"wottapoop.html\".", "published": "2004-08-18T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2004-0202", "severity": "medium", "cvss_score": 5.0, "description": "IDirectPlay4 Application Programming Interface (API) of Microsoft DirectPlay 7.0a thru 9.0b, as used in Windows Server 2003 and earlier allows remote attackers to cause a denial of service (application crash) via a malformed packet.", "published": "2004-08-06T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2003-0009", "severity": "medium", "cvss_score": 6.8, "description": "Cross-site scripting (XSS) vulnerability in Help and Support Center for Microsoft Windows Me allows remote attackers to execute arbitrary script in the Local Computer security context via an hcp:// URL with the malicious script in the topic parameter.", "published": "2003-03-07T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2002-1258", "severity": "medium", "cvss_score": 5.0, "description": "Two vulnerabilities in Microsoft Virtual Machine (VM) up to and including build 5.0.3805, as used in Internet Explorer and other applications, allow remote attackers to read files via a Java applet with a spoofed location in the CODEBASE parameter in the APPLET tag, possibly due to a parsing error.", "published": "2002-12-23T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2002-1325", "severity": "medium", "cvss_score": 5.0, "description": "Microsoft Virtual Machine (VM) build 5.0.3805 and earlier allows remote attackers to determine a local user's username via a Java applet that accesses the user.dir system property, aka \"User.dir Exposure Vulnerability.\"", "published": "2002-12-23T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}], "cpe:2.3:o:microsoft:windows_mobile:-:*:*:*:*:*:*:*": [{"cve_id": "CVE-2007-0685", "severity": "low", "cvss_score": 2.6, "description": "Internet Explorer on Windows Mobile 5.0 and Windows Mobile 2003 and 2003SE for Smartphones and PocketPC allows attackers to cause a denial of service (application crash and device instability) via unspecified vectors, possibly related to a buffer overflow.", "published": "2007-02-03T01:28:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2011-2041", "severity": "high", "cvss_score": 7.2, "description": "The Start Before Logon (SBL) functionality in Cisco AnyConnect Secure Mobility Client (formerly AnyConnect VPN Client) before 2.3.254 on Windows, and on Windows Mobile, allows local users to gain privileges via unspecified user-interface interaction, aka Bug ID CSCta40556.", "published": "2011-06-02T20:55:03.543", "last_modified": "2025-04-11T00:51:21.963"}, {"cve_id": "CVE-2011-2039", "severity": "high", "cvss_score": 7.6, "description": "The helper application in Cisco AnyConnect Secure Mobility Client (formerly AnyConnect VPN Client) before 2.3.185 on Windows, and on Windows Mobile, downloads a client executable file (vpndownloader.exe) without verifying its authenticity, which allows remote attackers to execute arbitrary code via the url property to a certain ActiveX control in vpnweb.ocx, aka Bug ID CSCsy00904.", "published": "2011-06-02T19:55:04.373", "last_modified": "2025-04-11T00:51:21.963"}, {"cve_id": "CVE-2007-0674", "severity": "high", "cvss_score": 7.1, "description": "Pictures and Videos on Windows Mobile 5.0 and Windows Mobile 2003 and 2003SE for Smartphones and PocketPC allows user-assisted remote attackers to cause a denial of service (device hang) via a malformed JPEG file.", "published": "2007-02-03T01:28:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2006-6908", "severity": "critical", "cvss_score": 10.0, "description": "Buffer overflow in the Bluetooth Stack COM Server in the Widcomm Bluetooth stack, as packaged as Widcomm Stack 3.x and earlier on Windows, Widcomm BTStackServer 1.4.2.10 and 1.3.2.7 on Windows, Widcomm Bluetooth Communication Software 1.4.1.03 on Windows, and the Bluetooth implementation in Windows Mobile or Windows CE on the HP IPAQ 2215 and 5450, allows remote attackers to cause a denial of service (service crash) and possibly execute arbitrary code via unspecified vectors.", "published": "2006-12-31T05:00:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:o:redhat:enterprise_linux_desktop:5:unknown:client:*:*:*:*:*": [{"cve_id": "CVE-2014-0181", "severity": "low", "cvss_score": 2.1, "description": "The Netlink implementation in the Linux kernel through 3.14.1 does not provide a mechanism for authorizing socket operations based on the opener of a socket, which allows local users to bypass intended access restrictions and modify network configurations by using a Netlink socket for the (1) stdout or (2) stderr of a setuid program.", "published": "2014-04-27T00:55:05.750", "last_modified": "2025-04-12T10:46:40.837"}, {"cve_id": "CVE-2007-5496", "severity": "low", "cvss_score": 1.9, "description": "Cross-site scripting (XSS) vulnerability in setroubleshoot 2.0.5 allows local users to inject arbitrary web script or HTML via a crafted (1) file or (2) process name, which triggers an Access Vector Cache (AVC) log entry in a log file used during composition of HTML documents for sealert.", "published": "2008-05-23T15:32:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2009-2904", "severity": "medium", "cvss_score": 6.9, "description": "A certain Red Hat modification to the ChrootDirectory feature in OpenSSH 4.8, as used in sshd in OpenSSH 4.3 in Red Hat Enterprise Linux (RHEL) 5.4 and Fedora 11, allows local users to gain privileges via hard links to setuid programs that use configuration files within the chroot directory, related to requirements for directory ownership.", "published": "2009-10-01T15:30:00.233", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-3825", "severity": "medium", "cvss_score": 4.4, "description": "pam_krb5 2.2.14 in Red Hat Enterprise Linux (RHEL) 5 and earlier, when the existing_ticket option is enabled, uses incorrect privileges when reading a Kerberos credential cache, which allows local users to gain privileges by setting the KRB5CCNAME environment variable to an arbitrary cache filename and running the (1) su or (2) sudo program. NOTE: there may be a related vector involving sshd that has limited relevance.", "published": "2008-10-03T15:07:10.777", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-5495", "severity": "medium", "cvss_score": 4.4, "description": "sealert in setroubleshoot 2.0.5 allows local users to overwrite arbitrary files via a symlink attack on the sealert.log temporary file.", "published": "2008-05-23T15:32:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-0411", "severity": "medium", "cvss_score": 6.8, "description": "Stack-based buffer overflow in the zseticcspace function in zicc.c in Ghostscript 8.61 and earlier allows remote attackers to execute arbitrary code via a postscript (.ps) file containing a long Range array in a .seticcspace operator.", "published": "2008-02-28T21:44:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1767", "severity": "high", "cvss_score": 7.5, "description": "Buffer overflow in pattern.c in libxslt before 1.1.24 allows context-dependent attackers to cause a denial of service (crash) and possibly execute arbitrary code via an XSL style sheet file with a long XSLT \"transformation match\" condition that triggers a large number of steps.", "published": "2008-05-23T15:32:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-3844", "severity": "critical", "cvss_score": 9.3, "description": "Certain Red Hat Enterprise Linux (RHEL) 4 and 5 packages for OpenSSH, as signed in August 2008 using a legitimate Red Hat GPG key, contain an externally introduced modification (Trojan Horse) that allows the package authors to have an unknown impact.  NOTE: since the malicious packages were not distributed from any official Red Hat sources, the scope of this issue is restricted to users who may have obtained these packages through unofficial distribution points.  As of 20080827, no unofficial distributions of this software are known.", "published": "2008-08-27T20:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:o:microsoft:windows_xp:sp3:unknown:english:*:*:*:*:*": [{"cve_id": "CVE-2009-0229", "severity": "medium", "cvss_score": 4.9, "description": "The Windows Printing Service in Microsoft Windows 2000 SP4, XP SP2 and SP3, Server 2003 SP2, Vista Gold, SP1, and SP2, and Server 2008 SP2 allows local users to read arbitrary files via a crafted separator page, aka \"Print Spooler Read File Vulnerability.\"", "published": "2009-06-10T18:00:00.250", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2009-0162", "severity": "medium", "cvss_score": 4.3, "description": "Cross-site scripting (XSS) vulnerability in Safari before 3.2.3, and 4 Public Beta, on Apple Mac OS X 10.5 before 10.5.7 and Windows allows remote attackers to inject arbitrary web script or HTML via a crafted feed: URL.", "published": "2009-05-13T15:30:00.517", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2009-1335", "severity": "medium", "cvss_score": 4.3, "description": "Microsoft Internet Explorer 7 and 8 on Windows XP and Vista allows remote attackers to cause a denial of service (application hang) via a large document composed of unprintable characters, aka MSRC 9011jr.", "published": "2009-04-17T14:30:00.703", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2009-0320", "severity": "medium", "cvss_score": 4.0, "description": "Microsoft Windows XP, Server 2003 and 2008, and Vista exposes I/O activity measurements of all processes, which allows local users to obtain sensitive information, as demonstrated by reading the I/O Other Bytes column in Task Manager (aka taskmgr.exe) to estimate the number of characters that a different user entered at a runas.exe password prompt, related to a \"benchmarking attack.\"", "published": "2009-01-28T18:30:00.217", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-5428", "severity": "medium", "cvss_score": 4.3, "description": "Opera 9.51 on Windows XP does not properly handle (1) multipart/mixed e-mail messages with many MIME parts and possibly (2) e-mail messages with many \"Content-type: message/rfc822;\" headers, which allows remote attackers to cause a denial of service (stack consumption or other resource consumption) via a large e-mail message, a related issue to CVE-2006-1173.", "published": "2008-12-11T15:30:00.580", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-4029", "severity": "medium", "cvss_score": 4.3, "description": "Cross-domain vulnerability in Microsoft XML Core Services 3.0 and 4.0, as used in Internet Explorer, allows remote attackers to obtain sensitive information from another domain via a crafted XML document, related to improper error checks for external DTDs, aka \"MSXML DTD Cross-Domain Scripting Vulnerability.\"", "published": "2008-11-12T23:30:01.557", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-4323", "severity": "medium", "cvss_score": 4.3, "description": "Windows Explorer in Microsoft Windows XP SP3 allows user-assisted attackers to cause a denial of service (application crash) via a crafted .ZIP file.", "published": "2008-09-29T20:09:59.593", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-3365", "severity": "medium", "cvss_score": 6.8, "description": "Directory traversal vulnerability in index.php in Pixelpost 1.7.1 on Windows, when register_globals is enabled, allows remote attackers to include and execute arbitrary local files via a .. (dot dot) in the language_full parameter.", "published": "2008-07-30T17:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1581", "severity": "medium", "cvss_score": 6.8, "description": "Heap-based buffer overflow in Apple QuickTime before 7.5 on Windows allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via crafted packed scanlines in PixData structures in a PICT image.", "published": "2008-06-10T18:32:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1024", "severity": "medium", "cvss_score": 6.8, "description": "Apple Safari before 3.1.1, when running on Windows XP or Vista, allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via a file download with a crafted file name, which triggers memory corruption.", "published": "2008-04-17T19:05:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:h:xerox:workcentre:m128:unknown:pro:*:*:*:*:*": [{"cve_id": "CVE-2008-2825", "severity": "medium", "cvss_score": 4.3, "description": "Cross-site scripting (XSS) vulnerability in the embedded Web Server in Xerox WorkCentre M123, M128, and 133 and WorkCentre Pro 123, 128, and 133 allows remote attackers to inject arbitrary web script or HTML via unspecified vectors.", "published": "2008-06-23T17:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:a:microsoft:ie:7.0.5730:unknown:gold:*:*:*:*:*": [], "cpe:2.3:o:microsoft:windows_xp:unknown:sp3:*:*:*:*:*:*": [{"cve_id": "CVE-2008-3474", "severity": "medium", "cvss_score": 6.5, "description": "Microsoft Internet Explorer 6 and 7 does not properly determine the domain or security zone of origin of web script, which allows remote attackers to bypass the intended cross-domain security policy and obtain sensitive information via a crafted HTML document, aka \"Cross-Domain Information Disclosure Vulnerability.\"", "published": "2008-10-15T00:12:15.817", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-3365", "severity": "medium", "cvss_score": 6.8, "description": "Directory traversal vulnerability in index.php in Pixelpost 1.7.1 on Windows, when register_globals is enabled, allows remote attackers to include and execute arbitrary local files via a .. (dot dot) in the language_full parameter.", "published": "2008-07-30T17:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1581", "severity": "medium", "cvss_score": 6.8, "description": "Heap-based buffer overflow in Apple QuickTime before 7.5 on Windows allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via crafted packed scanlines in PixData structures in a PICT image.", "published": "2008-06-10T18:32:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1024", "severity": "medium", "cvss_score": 6.8, "description": "Apple Safari before 3.1.1, when running on Windows XP or Vista, allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via a file download with a crafted file name, which triggers memory corruption.", "published": "2008-04-17T19:05:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-1026", "severity": "medium", "cvss_score": 6.8, "description": "Integer overflow in the PCRE regular expression compiler (JavaScriptCore/pcre/pcre_compile.cpp) in Apple WebKit, as used in Safari before 3.1.1, allows remote attackers to execute arbitrary code via a regular expression with large, nested repetition counts, which triggers a heap-based buffer overflow.", "published": "2008-04-17T19:05:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2008-0088", "severity": "medium", "cvss_score": 6.8, "description": "Unspecified vulnerability in Active Directory on Microsoft Windows 2000 and Windows Server 2003, and Active Directory Application Mode (ADAM) on XP and Server 2003, allows remote attackers to cause a denial of service (hang and restart) via a crafted LDAP request.", "published": "2008-02-12T21:00:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-5587", "severity": "medium", "cvss_score": 6.9, "description": "Buffer overflow in Macrovision SafeDisc secdrv.sys before 4.3.86.0, as shipped in Microsoft Windows XP SP2, XP Professional x64 and x64 SP2, Server 2003 SP1 and SP2, and Server 2003 x64 and x64 SP2 allows local users to overwrite arbitrary memory locations and gain privileges via a crafted argument to a METHOD_NEITHER IOCTL, as originally discovered in the wild.", "published": "2007-10-19T21:17:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-3758", "severity": "medium", "cvss_score": 4.3, "description": "Safari in Apple iPhone 1.1.1, and Safari 3 before Beta Update 3.0.4 on Windows and in Mac OS X 10.4 through 10.4.10, allows remote attackers to set Javascript window properties for web pages that are in a different domain, which can be leveraged to conduct cross-site scripting (XSS) attacks.", "published": "2007-09-27T22:17:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-3760", "severity": "medium", "cvss_score": 4.3, "description": "Cross-site scripting (XSS) vulnerability in Safari in Apple iPhone 1.1.1, and Safari 3 before Beta Update 3.0.4 on Windows and Mac OS X 10.4 through 10.4.10, allows remote attackers to inject arbitrary web script or HTML via frame tags.", "published": "2007-09-27T22:17:00.000", "last_modified": "2025-04-09T00:30:58.490"}, {"cve_id": "CVE-2007-4671", "severity": "medium", "cvss_score": 6.8, "description": "Unspecified vulnerability in Safari in Apple iPhone 1.1.1, and Safari 3 before Beta Update 3.0.4 on Windows and Mac OS X 10.4 through 10.4.10, allows remote attackers to \"alter or access\" HTTPS content via an HTTP session with a crafted web page that causes Javascript to be applied to HTTPS pages from the same domain.", "published": "2007-09-27T22:17:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:a:hp:insight_diagnostics:7.7.0_rev_b:unknown:offline:*:*:*:*:*": [{"cve_id": "CVE-2008-3542", "severity": "high", "cvss_score": 7.8, "description": "Unspecified vulnerability in HP Insight Diagnostics before 7.9.1.2402 allows remote attackers to read arbitrary files via unknown vectors.", "published": "2008-10-02T18:18:05.820", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:h:xerox:workcentre:m123:unknown:pro:*:*:*:*:*": [{"cve_id": "CVE-2008-2825", "severity": "medium", "cvss_score": 4.3, "description": "Cross-site scripting (XSS) vulnerability in the embedded Web Server in Xerox WorkCentre M123, M128, and 133 and WorkCentre Pro 123, 128, and 133 allows remote attackers to inject arbitrary web script or HTML via unspecified vectors.", "published": "2008-06-23T17:41:00.000", "last_modified": "2025-04-09T00:30:58.490"}], "cpe:2.3:a:microsoft:internet_information_server:4.0:unknown:unknown:ja:*:*:*:*": [{"cve_id": "CVE-2000-0649", "severity": "low", "cvss_score": 2.6, "description": "IIS 4.0 allows remote attackers to obtain the internal IP address of the server via an HTTP 1.0 request for a web page which is protected by basic authentication and has no realm defined.", "published": "2000-07-13T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0167", "severity": "low", "cvss_score": 2.1, "description": "IIS Inetinfo.exe allows local users to cause a denial of service by creating a mail file with a long name and a .txt.eml extension in the pickup directory.", "published": "2000-02-15T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-0861", "severity": "low", "cvss_score": 2.6, "description": "Race condition in the SSL ISAPI filter in IIS and other servers may leak information in plaintext.", "published": "1999-08-11T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-1999-1538", "severity": "low", "cvss_score": 2.1, "description": "When IIS 2 or 3 is upgraded to IIS 4, ism.dll is inadvertently left in /scripts/iisadmin, which does not restrict access to the local machine and allows an unauthorized user to gain access to sensitive server information, including the Administrator's password.", "published": "1999-01-14T05:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0770", "severity": "medium", "cvss_score": 6.4, "description": "IIS 4.0 and 5.0 does not properly restrict access to certain types of files when their parent folders have less restrictive permissions, which could allow remote attackers to bypass access restrictions to some files, aka the \"File Permission Canonicalization\" vulnerability.", "published": "2000-10-20T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0630", "severity": "medium", "cvss_score": 5.0, "description": "IIS 4.0 and 5.0 allows remote attackers to obtain fragments of source code by appending a +.htr to the URL, a variant of the \"File Fragment Reading via .HTR\" vulnerability.", "published": "2000-07-17T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0631", "severity": "medium", "cvss_score": 5.0, "description": "An administrative script from IIS 3.0, later included in IIS 4.0 and 5.0, allows remote attackers to cause a denial of service by accessing the script without a particular argument, aka the \"Absent Directory Browser Argument\" vulnerability.", "published": "2000-07-14T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0408", "severity": "medium", "cvss_score": 5.0, "description": "IIS 4.05 and 5.0 allow remote attackers to cause a denial of service via a long, complex URL that appears to contain a large number of file extensions, aka the \"Malformed Extension Data in URL\" vulnerability.", "published": "2000-05-11T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0304", "severity": "medium", "cvss_score": 5.0, "description": "Microsoft IIS 4.0 and 5.0 with the IISADMPWD virtual directory installed allows a remote attacker to cause a denial of service via a malformed request to the inetinfo.exe program, aka the \"Undelimited .HTR Request\" vulnerability.", "published": "2000-05-10T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}, {"cve_id": "CVE-2000-0413", "severity": "medium", "cvss_score": 5.0, "description": "The shtml.exe program in the FrontPage extensions package of IIS 4.0 and 5.0 allows remote attackers to determine the physical path of HTML, HTM, ASP, and SHTML files by requesting a file that does not exist, which generates an error message that reveals the path.", "published": "2000-05-06T04:00:00.000", "last_modified": "2025-04-03T01:03:51.193"}], "cpe:2.3:a:hp:insight_diagnostics:7.7.0:unknown:offline:*:*:*:*:*": [{"cve_id": "CVE-2008-3542", "severity": "high", "cvss_score": 7.8, "description": "Unspecified vulnerability in HP Insight Diagnostics before 7.9.1.2402 allows remote attackers to read arbitrary files via unknown vectors.", "published": "2008-10-02T18:18:05.820", "last_modified": "2025-04-09T00:30:58.490"}]}